//
// This file contains an 'Intel Peripheral Driver' and is
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may
// be modified by the user, subject to additional terms of the
// license agreement
//
// *++
//
// Copyright (c) 1999 - 2015 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
//

//---------------------------------------------------------------------------
// USB CONFIGURATION
//---------------------------------------------------------------------------
//
// USB Configuration
//

/=#

#langdef   en-US "English"

#string STR_USB_OPTIONS_FORM_TITLE             #language en-US "USB Configuration"
#string STR_USB_OPTIONS_FORM_HELP               #language en-US "USB Configuration settings"


#string STR_USB_PORT0_TITLE                        #language en-US "Port 0"
#string STR_USB_PORT1_TITLE                        #language en-US "Port 1"
#string STR_USB_PORT2_TITLE                        #language en-US "Port 2"
#string STR_USB_PORT3_TITLE                        #language en-US "Port 3"
#string STR_USB_PORTX_HELP                         #language en-US "Port configuration"

#string STR_USBSS_OPTIONS_FORM_TITLE              #language en-US "USB SS Configuration"
#string STR_USBSS_OPTIONS_FORM_HELP              #language en-US "USB super speed configuration"

#string STR_USBHS_OPTIONS_FORM_TITLE              #language en-US "USB HS Configuration"
#string STR_USBHS_OPTIONS_FORM_HELP              #language en-US "USB high speed configuration"




#string STR_USB_PRECONDITION_SUPPORT            #language en-US "USB Precondition"
#string STR_USB_PRECONDITION_SUPPORT_HELP       #language en-US "Precondition work on USB host controller and root ports for faster enumeration."
#string STR_USB_XHCI_IDLE_L1_SUPPORT            #language en-US "XHCI Idle L1"
#string STR_USB_XHCI_IDLE_L1_SUPPORT_HELP       #language en-US "Enabled XHCI Idle L1. Disabled to workaround USB3 hot plug will fail after 1 hot plug removal.  Please put the system to G3 for the new settings to take effect."
#string STR_USB_SENSOR_HUB_SUPPORT              #language en-US "USB Sensor Hub"
#string STR_USB_SENSOR_HUB_SUPPORT_HELP         #language en-US "USB Sensor Hub enable/disable"
//
// BEGIN - Setup Options visible only when XHCI Mode = "Manual"
//

#string STR_USB_XHCI_SUPPORT                    #language en-US "XHCI Pre-Boot Driver"
#string STR_USB_XHCI_SUPPORT_HELP               #language en-US "Enable/Disable XHCI Pre-Boot Driver support.  Definition of "Pre-Boot" means before OS is booted.  Pre-Boot Driver refer to a piece of code inside the BIOS that controls input and output operations during boot time.  This options decide if BIOS USB driver is 3.0 aware or not."

#string STR_USB_SSIC_1_SUPPORT                  #language en-US "SSIC Port 1"
#string STR_USB_SSIC_2_SUPPORT                  #language en-US "SSIC Port 2"
#string STR_USB_SSIC_SUPPORT_HELP               #language en-US "Enable/Disable support for SSIC."

//
// END OF - Setup Options visible only when XHCI Mode = "Manual"
//

#string STR_PCH_USB_PORT_TERM_PROMPT            #language en-US "USB Port Disable Override"
#string STR_PCH_USB_PORT_TERM_HELP              #language en-US "Selectively Enable/Disable the corresponding USB port from reporting a Device Connection to the controller."
#string STR_PCH_USB_PORT_TERM_PER_PORT          #language en-US "Select Per-Pin"

#string STR_PCH_USB_SS_PORTX_PROMPT             #language en-US "USB SS Physical Connector"
#string STR_PCH_USB_HS_PORTX_PROMPT             #language en-US "USB HS Physical Connector"
#string STR_PCH_USB_PORT_DIS_HELP               #language en-US "Enable/Disable this USB Physical Connector (physical port).  Once disabled, any USB devices plug into the connector will not be detected by BIOS or OS."

//
// XDCI Configuration
//
#string STR_PCH_XDCI_SUPPORT_PROMPT             #language en-US "xDCI Support"
#string STR_PCH_XDCI_SUPPORT_HELP               #language en-US "Enable/Disable xDCI (USB OTG Device)."


#string STR_XHCI_INACTIVITY_L1E_PROMPT      #language en-US "Inactivity Initiated L1"
#string STR_XHCI_INACTIVITY_L1E_HELP        #language en-US "If programmed to non-zero, it allows L1 power managed to be enabled after the time-out period specified"
#string STR_32_BB_CCLK                      #language en-US "32 bb_cclk"
#string STR_64_BB_CCLK                      #language en-US "64 bb_cclk"
#string STR_128_BB_CCLK                     #language en-US "128 bb_cclk"
#string STR_256_BB_CCLK                     #language en-US "256 bb_cclk"
#string STR_512_BB_CCLK                     #language en-US "512 bb_cclk"
#string STR_1024_BB_CCLK                    #language en-US "1024 bb_cclk"
#string STR_131072_BB_CCLK                  #language en-US "131072 bb_cclk"
#string STR_XHC_L1E_PROMPT                  #language en-US "XHC Initiated L1"
#string STR_XHC_L1E_HELP                    #language en-US "If set, allow the XHC initiated L1 power mangement to be enabled."

#string STR_PCH_XHCI_COMPLIANCE_PROMPT          #language en-US "XHCI Compliance Mode"
#string STR_PCH_XHCI_COMPLIANCE_HELP            #language en-US "Disable Compiance Mode"

//
// End of file
//
